
* Command line usage

#+begin_src bash :results pp :exports both
./make-preseed-iso.sh --help
#+end_src

#+RESULTS:
#+begin_example
Usage: make-preseed-iso.sh path/to/debian.iso

  -h|--help
      Print this message.
  -d|--debug
      Enable debconf debugging log level in the generated iso.
  -p|--preseed preseed.cfg|preseed_dir
      Use this file as preseed.cfg, or a directory with preseed.cfg inside.
  -o|--output preseed-debian-image.iso
      Save ISO to this name, default is to prefix ISO source name with "preseed-".
  -f|--force
      Force overwriting output file. Default is to fail if output file exists.
  -s|--static-network
      Disable DHCP discovery
  -i|--ip-address
      Set the ip address
  -n|--netmask
      Set the netmask
  -g|--gateway
      Set the gateway
  -N|--nameservers
      Set the nameservers
  -H|--hostname
      Set the hostname
  -D|--domain
      Set the domain. If no domain is provided, no domain will be configured.
  -u|--user
      Set the username of the user created.
  -w|--without-root
      Weither or not setting a password on root user.

  All options can be set via environment variables.

  Notably root_sha512 and user_sha512 have no CLI flags but can be used as
  crypted password information.

  To generate them, use:
    # openssl passwd -6

#+end_example

** Check the integrity of the iso

#+begin_src bash :export both
sha256sum -c SHA256SUMS --ignore-missing
#+end_src

#+RESULTS:
: debian-12.6.0-amd64-netinst.iso: OK

** Authenticate the iso

If you do not have the signing key, you can import it with :
#+begin_src bash
gpg --keyserver keyring.debian.org --recv DF9B9C49EAA9298432589D76DA87E80D6294BE9B
#+end_src

#+begin_src bash :results pp :export both
gpg --verify SHA256SUMS.sign SHA256SUMS
#+end_src

#+RESULTS:
: gpg: assuming signed data in 'SHA256SUMS'
: gpg: Signature made Sat 29 Jun 2024 10:50:21 PM CEST
: gpg:                using RSA key DF9B9C49EAA9298432589D76DA87E80D6294BE9B
: gpg: Good signature from "Debian CD signing key <debian-cd@lists.debian.org>" [unknown]
: gpg: WARNING: This key is not certified with a trusted signature!
: gpg:          There is no indication that the signature belongs to the owner.
: Primary key fingerprint: DF9B 9C49 EAA9 2984 3258  9D76 DA87 E80D 6294 BE9B

